while True:
    oper = input('ты в чёрной дыре!!!!!!!')
    if oper == "и что мне делать" or oper == "И что мне делать":
        oper = input("нам надо отсюдо выбраться!")
        if oper == "Но как" or oper == "но как":
            oper = input("расшифруй слово КОДИУМ")
            if oper == "Но я не знаю" or oper == "но я не знаю":
                oper = input("подумай!!!! (звук обрыва связи)")
                if oper == "Ок" or oper == "ок":
                    oper = input("-д-у-м-а-й-")
                    if oper == "к-коронно о-ореховый д-дневно и-инностранный у-узноваемый м-мозг":
                        oper = input("(восстоновление связи) неееееееет ")
                        if oper == "Но я не знаю" or oper == "но я не знаю":
                            oper = input("придётся тебе сказать-----к-космическо о-одиночный д-дистанционно и-интересный у-уникально-крутой у-урок")
                            if oper == "Ок а что теперь" or oper == "ок а что теперь":
                                oper = input("потеря св-я-з--- ")
                                if oper == "Неет" or oper == "неет":
                                    oper = input("кон-е------ц")
                                    break
    else:
        print("конец")
